#########################################################################
# File Name: menu.sh
# Author: fluency
# mail: 1005068694@qq.com
# Created Time: 2018年06月05日 星期二 20时34分01秒
#########################################################################
#!/bin/bash

echo -e "\033[32mPlease select Menu follow:\033[2m"
echo -e "\033[32m--------------------------------------\033[2m"

echo "1)安装apache服务器"
echo "2)安装Mysql服务器"
echo "3)安装Boa服务器"
echo "4)安装DHCP服务器"
echo "5)安装LAMP WEB服务器"

echo -e "\033[32m--------------------------------------\033[0m"
