#########################################################################
# File Name: grep.sh
# Author: fluency
# mail: 1005068694@qq.com
# Created Time: 2018年06月08日 星期五 11时27分04秒
#########################################################################
#!/bin/bash
# cat 文件名 |grep "查找字符"    用于查找某字符
# cat 文件名 |grep -v "查找字符" 用于查找除了某字符的其他字符
# grep "^字符" 文件名            查找以字符开头(^)的字符串
# grep "字符$" 文件名            查找以字符结尾($)的字符串
# grep "[0-9]" 文件名            查找0-9的字符串
# grep "[a-z]" 文件名            查找a-z的字符串
# grep "[A-Z]" 文件名            查找A-Z的字符串
# grep -E "([0-9]{1,3}\.){3}[0-9]{1,3}" 匹配IP
# grep -n "字符" 文件名          显示字符的行号

